read_verilog demux_dest.v

hierarchy -check -top demux_dest

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty ./lib/cmos_cells.lib

abc -liberty ./lib/cmos_cells.lib

clean

write_verilog ./demux_dest_estr.v