read_verilog Modulo.v

hierarchy -check -top Modulo

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty ./lib/cmos_cells.lib

abc -liberty ./lib/cmos_cells.lib

clean

write_verilog ./Modulo_estr.v